import Image from 'next/image';
import Link from 'next/link';
import React from 'react';
import avatar from '../public/Rectangle 3.png';
import styles from '../styles/Footer.module.scss';
import help from '../public/Vector.png';
import Logo from './Logo';

const Footer = () => {
  return (
    <footer className={styles.footer}>
      <div className="container">
        <div className={styles.wrapper}>
          <Logo />
          <div className={styles.nav}>
            <h3 className={styles['h3']}> Навигация</h3>
            <nav className={styles.links}>
              <Link href="/">
                <a className={styles.link}>Главная</a>
              </Link>
              <Link href="/">
                <a className={styles.link}>Поиск</a>
              </Link>
              <Link href="/">
                <a className={styles.link}>Рестораны</a>
              </Link>
              <Link href="/">
                <a className={styles.link}>Магазины</a>
              </Link>
            </nav>
          </div>
          <div className={styles.nav}>
            <h3 className={styles['h3']}>Помощь покупателю</h3>
            <nav className={styles.links}>
              <Link href="/">
                <a className={styles.link}>Как производиться доставка</a>
              </Link>
              <Link href="/">
                <a className={styles.link}>Оплата</a>
              </Link>
              <Link href="/">
                <a className={styles.link}>Помощь</a>
              </Link>
            </nav>
          </div>

          <div className={styles.reversed}>
            <h3 className={styles['h3']}>+7 (837) 00-10-00</h3>
            <button className={styles.reverse}>
              <svg
                width="18"
                height="18"
                viewBox="0 0 18 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M11.7416 6.37499L7.79989 10.325L6.25822 8.77499C6.1013 8.61807 5.88847 8.52991 5.66655 8.52991C5.44464 8.52991 5.23181 8.61807 5.07489 8.77499C4.91797 8.93191 4.82981 9.14474 4.82981 9.36666C4.82981 9.47654 4.85146 9.58535 4.89351 9.68686C4.93556 9.78838 4.99719 9.88062 5.07489 9.95832L7.20822 12.0917C7.28569 12.1698 7.37786 12.2318 7.47941 12.2741C7.58096 12.3164 7.68988 12.3382 7.79989 12.3382C7.9099 12.3382 8.01882 12.3164 8.12037 12.2741C8.22192 12.2318 8.31409 12.1698 8.39156 12.0917L12.9249 7.55832C13.0026 7.48062 13.0642 7.38838 13.1063 7.28686C13.1483 7.18535 13.17 7.07654 13.17 6.96666C13.17 6.85677 13.1483 6.74797 13.1063 6.64645C13.0642 6.54493 13.0026 6.45269 12.9249 6.37499C12.8472 6.29729 12.7549 6.23566 12.6534 6.19361C12.5519 6.15156 12.4431 6.12991 12.3332 6.12991C12.2233 6.12991 12.1145 6.15156 12.013 6.19361C11.9115 6.23566 11.8193 6.29729 11.7416 6.37499ZM8.99989 0.666656C7.90554 0.666656 6.82191 0.882205 5.81086 1.30099C4.79981 1.71978 3.88115 2.33361 3.10733 3.10743C1.54453 4.67024 0.666555 6.78985 0.666555 8.99999C0.65927 10.9243 1.32555 12.7904 2.54989 14.275L0.883222 15.9417C0.76759 16.0588 0.68926 16.2077 0.658115 16.3693C0.62697 16.531 0.644405 16.6982 0.708222 16.85C0.777437 16.9999 0.889642 17.1259 1.03059 17.212C1.17155 17.298 1.33489 17.3403 1.49989 17.3333H8.99989C11.21 17.3333 13.3296 16.4553 14.8924 14.8925C16.4552 13.3297 17.3332 11.2101 17.3332 8.99999C17.3332 6.78985 16.4552 4.67024 14.8924 3.10743C13.3296 1.54463 11.21 0.666656 8.99989 0.666656ZM8.99989 15.6667H3.50822L4.28322 14.8917C4.43843 14.7355 4.52555 14.5243 4.52555 14.3042C4.52555 14.084 4.43843 13.8728 4.28322 13.7167C3.19204 12.6267 2.51253 11.1921 2.36046 9.65732C2.20839 8.12253 2.59317 6.58249 3.44924 5.29959C4.30531 4.01669 5.57971 3.07029 7.05532 2.62163C8.53092 2.17298 10.1164 2.24983 11.5417 2.83908C12.967 3.42834 14.1439 4.49355 14.8719 5.85323C15.5999 7.21291 15.8339 8.78294 15.5342 10.2958C15.2344 11.8087 14.4193 13.1709 13.2278 14.1502C12.0364 15.1295 10.5422 15.6654 8.99989 15.6667Z"
                  fill="#813CAB"
                />
              </svg>
              Обратная связь
            </button>
          </div>
          <div className={styles.p}>
            В любое время мы ждём ваши вопросы, комментарии и предложения
          </div>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
